''' 
    --- 검색 알고리즘 ---
    
    1. 검색 알고리즘은 검색과 키(key value)를 이용하여 조건 하나만 지정하거나 논리곱, 논리합을 사용함으로 복합적으로 지정할 수 있다.
    2. 검색의 3가지의 종류가 있으며 이번 3장에서는 배열 검색을 학습한다.
        2.1 배열 검색(이번 장에서)
            - 선형 검색 : 무작위로 늘어놓은 데이터 집합에서 검색을 수행
            - 이진 검색 : 일정한 규칙으로 늘어놓은 데이터 집합에서 빠른 검색을 수행
            - 해시법 : 추가 or 삭제가 자주 일어나는 데이터 집합에서 빠른 검색을 수행
                - 체인법 : 같은 해시값 데이터를 연결 리스트로 연결하는 방법
                - 오픈 주소법 : 데이터를 위한 해시값이 충돌할 때 재해시하는 방법
        2.2 연결 리스트 검색((8장에서))
        2.3 이진 검색 트리 검색(9장에서)
        
        데이터 집합이 있을 때 계산 시간이 짧은 알고리즘을 선택하면 되지만 검색과 데이터의 추가 or 삭제등의 추가적인 작업이 들어간다면 다른 알고리즘을 생각해 봐야한다.
        즉, 상황에 맞게 용도, 목적, 속도, 자료구조 등을 고려해야 한다.
'''
